brew "bash-completion@2"
brew "coreutils"
brew "bats-core"
brew "croc"
brew "dust"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-extras"
brew "gnu-sed"
brew "grep"
brew "grip"
brew "htop"
brew "httpie"
brew "lazygit"
brew "lf"
brew "lsd"
brew "n"
brew "nano"
brew "pandoc"
brew "pipx"
brew "poppler"
brew "psgrep"
brew "shellcheck"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "topgrade"
brew "tree"
brew "unar"
brew "uni"
brew "viu"
brew "zoxide"
